{
  title: 'Регистрация в kopnik org {{halfUser}}',
  messageNew: 'Здравия, братцы! Единства и благополучия всему славянскому роду!\n\
    \n\
    {{halfUser}}, я создал этот чат для того, чтобы ты мог заверить свои личные данные, которые указал во время регистрации в Копнике.\n\
    Это обязательная процедура, которую проходит каждый новый участник сети, здесь ты можешь прочитать почему это так важно https://github.com/kopnik-org/kopnik-wiki/blob/main/ru/witness/why-witness.md\n\
    Обычно процедура заверения проходит 5 минут и не представляет сложности для честного общинника.\n\
    \n\
    Если ты готов пройти процедуру заверения, чтобы присоединиться к общине, то слушай, как она проходит:\n\
    1. Сначала Заверитель ознакомится с твоими личными данными, которые ты указал во время регистрации.\n\
    2. Затем заверитель затребует доказательства:\n\
    2.1. Паспорт для подтверждения ФИО, возраста, последних 4 цифр и места проживания.\n\
    2.2. Если ты заявился на роль копного мужа, то будь готов так же подтвердить семью.\n\
    3. Ты предоставишь затребованные доказательства Заверителю.\n\
    4. Получив доказательства, Заверитель сделает заключение о подлинности данных, которые ты указал во время регистрации.\n\
    5. Наконец, на основании заключения Заверитель примет тебя в Копник или нет.\n\
    \n\
    В зависимости от географического расстояния и возможности связаться по средствам связи она может проходить в форме личной встречи или видео звонка целиком на усмотрение Заверителя.\n\
    Если процедура заверения закончилась отказом, ее можно повторить после устранения замечаний Заверителя.\n\
    Таков ее полный порядок.\n\
    \n\
    {{halfUser}}, я создал этот чат с единственной целью, чтобы ты имел возможность заверить свои регистрационные данные для становления полноправным участником копной сети.\n\
    Если ты не готов проходить процедуру заверения, Заверитель не будет тебя уговаривать.\n\
    В таком случае просто выйди из этого чата.\n\
    \n\
    Если ты готов пройти процедуру заверения, напиши в этом чате слово "готов", настройся и приготовься следовать указаниям Заверителя.\n\
    Твой Заверитель {{witness}}\n\
    Удачи!\n\
    \n\
    Напиши "готов" и удобное время для связи',
  messagePending: '{{halfUser}} внес изменения в Личные данные:\n\
    {{changeset}}',
  repeat: 'Здарова, браты! Единства и благополучия всему славянскому роду!\n\
    \n\
    Я собрал вас для того, чтобы {{halfUser}} имел возможность заверить изменения в своих Личных данных:\n\
    {{changeset}}\n\
    \n\
    {{halfUser}}, {{witness}} будет твоим Заверителем. Напоминаю тебе порядок процедуры заверения:\n\
    1. Сначала Заверитель ознакомится с изменениями, которые ты внес в личные данные.\n\
    2. Затем Заверитель затребует доказательства:\n\
    2.1. Паспорт, если ты изменил ФИО, возраст, последние 4 цифры и место проживания.\n\
    2.2. Если ты изменил роль на копного мужа, то будь готов так же подтвердить семью.\n\
    3. Ты предоставишь затребованные доказательства Заверителю.\n\
    4. Получив доказательства, Заверитель сделает заключение о подлинности изменений.\n\
    5. Наконец, на основании заключения Заверитель допустит тебя в Копник или нет.\n\
    \n\
    Если ты готов пройти процедуру заверения, напиши в этом чате слово "готов", настройся и приготовься следовать указаниям Заверителя.\n\
    Удачи!\n\
    \n\
    Напиши "готов" и удобное время для связи'
}
