{
  title: 'Регистрация в kopnik org {{halfUser.iof}}',
  message: 'Здравия, братцы! Единства и благополучия всему славянскому роду!\n\
    \n\
    {{halfUserLink}}, я создал этот чат для того, чтобы ты мог заверить свои личные данные, которые указал во время регистрации.\n\
    Это обязательная процедура, которую проходит каждый новый участник сети kopnik org.\n\
    Благодаря ей сеть отображает подлинную информацию обо всех участниках сети.\n\
    Ниже я расскажу тебе насколько это важно для воссоздания Копного Права.\n\
    Обычно процедура заверения проходит 5 минут и не представляет сложности для честного общинника.\n\
    \n\
    Теперь позволь мне объяснить, насколько важна процедура заверения для восстановления Копного Права.\n\
    Как ты знаешь, в Копном Праве объединение и управление общиной происходит исключительно через копных мужей, все остальные члены общины как дети, жены, престарелые родители, делегируют эти полномочия копным мужам и представлены через них.\n\
    Копные мужи отбираются в общине по известному набору личных качеств, которые были изложены Сергеем Даниловым и Алексеем Трехлебовым. Это дом, хозяйство, семья и дети.\n\
    Это была короткая справка.\n\
    \n\
    А теперь представь, что вместо настоящих копных мужей общину наводнят самозванцы: вместо одного истинного копного мужа десятки самозванцев, диванных воинов и самопровозглашённых пророков с повышенным самомнением.\n\
    Представь как все эти самозванцы разбавляют ряды истинных копных мужей, присутствие которых сводится на нет, потому как их количество намного меньше.\n\
    Если ты представил, то согласишься, что в таком состоянии наша община вовсе не соответствовала бы Копному Праву, в ней утратились бы все сильные стороны истинного Копного Права и само ее предназначение.\n\
    \n\
    Наконец, не менее важное заверять место проживания.\n\
    Это необходимо общинникам для взаимного поиска и построения живых общин на земле по территориальному принципу (дом, двор, город, область).\n\
    Без привязки к местности вместо таких живых общин получились бы воображаемые интернетные общины.\n\
    \n\
    Пока община не разрастется достаточно для того, чтобы копные мужи сами на местах могли проводить подобную проверку, она будет проводиться специальными уполномоченными заверителями здесь.\n\
    На данный момент это так.\n\
    \n\
    Если ты согласен присоединиться к общине, то слушай, как тебе предстоит проходить процедуру заверения:\n\
    1. Сначала Заверитель ознакамливается с твоими регистрационными данными.\n\
    2. Затем, учитывая выбранную тобой копную роль, заверитель затребует доказательства твоих регистрационных данных:\n\
    2.1. Паспорт для подтверждения ФИО, возраста, последних 4 цифр и места проживания.\n\
    2.2. Если ты заявился на роль копного мужа, будь так же готов показать семью.\n\
    3. Ты предоставляешь затребованные доказательства.\n\
    4. Получив доказательства, Заверитель сопоставляет регистрационные данные и твою реальную личность.\n\
    5. Наконец, на основании этого Заверитель принимает решение принимать тебя или нет.\n\
    \n\
    Как я уже говорил, обычно процедура заверения проходит 5 минут и не представляет сложности для честного общинника. В зависимости от географического расстояния и возможности связаться по средствам связи она может проходить в форме личной встречи, видео звонка, голосового звонка, фотографии или по иному целиком на усмотрение Заверителя.\n\
    Если процедура заверения закончилась отказом, ее можно повторить после устранения замечаний Заверителя.\n\
    Таков ее полный порядок.\n\
    \n\
    {{halfUserLink}}, я создал этот чат с единственной целью, чтобы ты имел возможность заверить свои регистрационные данные для становления полноправным участником копной сети.\n\
    Если ты не готов проходить процедуру заверения, Заверитель не будет тебя уговаривать.\n\
    В таком случае просто выйди из этого чата.\n\
    \n\
    Если ты готов пройти процедуру заверения, напиши в этом чате слово "готов", настройся и приготовься следовать указаниям Заверителя.\n\
    Удачи!\n\
    \n\
    Напиши "готов"'
}
